In [2]:
#importing libraries/modules 
import sqlite3 as sql
import csv
import pandas as pd 
import numpy as np

In [4]:
tips = pd.read_csv("C:\\Users\\TOYIN OLAPE\\Documents\\Stutern\\Data Sets\\automobiles.csv")
tips.dtypes
tips.head()

,mpg,cyl,displ,hp,weight,accel,yr,origin,name
0,18.0,8,307.0,130,3504,12.0,1970-01-01,US,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,1970-01-01,US,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,1970-01-01,US,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,1970-01-01,US,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,1970-01-01,US,ford torino

## Creating Database and table

In [5]:
#Creating a Database 
con = sql.connect("auto.db")
cur = con.cursor()

In [16]:
#Creating a Table 
tab = """CREATE TABLE automobile (mpg REAL, cyl INTEGER, displ REEAL, hp INTEGER, weight INTEGER, accel REAL, yr DATE, origin TEXT, name TEXT)"""

In [17]:
cur.execute(tab)

In [18]:
file = open("C:\\Users\\TOYIN OLAPE\\Documents\\Stutern\\Data Sets\\auto.csv")
rows = csv.reader(file)
cur.executemany("INSERT INTO automobile VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)", rows)

In [24]:
cur.execute("SELECT * FROM automobile")

#print(cur.fetchall())
#Print first 4 rows instead of the above 
print(cur.fetchmany(4))

[]

In [8]:
#Prinitng the content of the Database using iteration
bills = cur.fetchmany(5)
for bill in bills:
    print(bill)

(23.68, 3.31, 'Male', 'No', 'Sun', 'Dinner', 2, 0.1397804054054054)
(24.59, 3.61, 'Female', 'No', 'Sun', 'Dinner', 4, 0.14680764538430255)
(25.29, 4.71, 'Male', 'No', 'Sun', 'Dinner', 4, 0.18623962040332148)
(8.77, 2.0, 'Male', 'No', 'Sun', 'Dinner', 2, 0.22805017103762829)
(26.88, 3.12, 'Male', 'No', 'Sun', 'Dinner', 4, 0.11607142857142858)

In [9]:
#Accessing the values by the column names 
for bill in bills:
    total_bill, tip, sex, smoker, day, time, size, fraction = bill
    print(total_bill, tip, sex, smoker)

23.68 3.31 Male No
24.59 3.61 Female No
25.29 4.71 Male No
8.77 2.0 Male No
26.88 3.12 Male No

In [10]:
"""
Accessing the values by the column names 
Also note that this method works like index back wards 
"""

for bill in bills:
    total_bill, _, _, smoker, _, _, _, _ = bill
    print(total_bill, smoker)

23.68 No
24.59 No
25.29 No
8.77 No
26.88 No

In [11]:
#Starts from the last column 

for bill in bills:
    _, _, _, smoker, _, _, _, _ = bill
    print(_)

0.1397804054054054
0.14680764538430255
0.18623962040332148
0.22805017103762829
0.11607142857142858

In [12]:
for bill in bills:
    total_bill, tip, sex, smoker, day, time, size, fraction = bill
    print(f"{total_bill}\t\t {tip}\t\t {sex}\t\t{smoker}")

23.68		 3.31		 Male		No
24.59		 3.61		 Female		No
25.29		 4.71		 Male		No
8.77		 2.0		 Male		No
26.88		 3.12		 Male		No

In [13]:
con.commit()
con.close()